{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "discussion_social",
    "1": "general_wiki",
    "2": "movies",
    "3": "technical_code",
    "4": "technical_oracle",
    "5": "weather"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "discussion_social": 0,
    "general_wiki": 1,
    "movies": 2,
    "technical_code": 3,
    "technical_oracle": 4,
    "weather": 5
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.6",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 50265
}
