{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "academic_research",
    "1": "discussion_social",
    "2": "food_nutrition",
    "3": "general_wiki",
    "4": "medical_research",
    "5": "medicine",
    "6": "movies",
    "7": "technical_code",
    "8": "technical_oracle",
    "9": "weather"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "academic_research": 0,
    "discussion_social": 1,
    "food_nutrition": 2,
    "general_wiki": 3,
    "medical_research": 4,
    "medicine": 5,
    "movies": 6,
    "technical_code": 7,
    "technical_oracle": 8,
    "weather": 9
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.6",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
